airfoil_rotating/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

9
(
    wall1
    {
        type            patch;
        nFaces          1215;
        startFace       822341;
    }
    wall2
    {
        type            patch;
        nFaces          1215;
        startFace       823556;
    }
    wall3
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2025;
        startFace       824771;
    }
    wall4
    {
        type            wall;
        inGroups        1(wall);
        nFaces          5399;
        startFace       826796;
    }
    wall5
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2025;
        startFace       832195;
    }
    wall6
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1215;
        startFace       834220;
    }
    AMI
    {
        type            wall;
        inGroups        1(wall);
        nFaces          28012;
        startFace       835435;
    }
    AMI_slave
    {
        type            wall;
        inGroups        1(wall);
        nFaces          28629;
        startFace       863447;
    }
    wing
    {
        type            wall;
        inGroups        1(wall);
        nFaces          3670;
        startFace       892076;
    }
)

// ************************************************************************* //
